<?php
/**
 * 常用正则验证，匹配整个语句 
 * 比如url,整个为url,而不能判断内容包含url
 */
$validate = array(
	'require'	=> '/.+/',
    'email'		=> '/^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/',
    'url'		=> '/^http|https:\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$/',
    'number'	=> '/^\d+$/',  // number表示quantity，是数量、数额的意思
	'currency'	=> '/^\d+(\.\d+)?$/',

    'integer'	=> '/^[-\+]?\d+$/',
    'double'	=> '/^[-\+]?\d+(\.\d+)?$/',

    'english'	=> '/^[a-zA-Z]+$/',
	'username'	=> '/^([a-zA-Z]){1}([a-zA-Z0-9_\-]){5,19}$/', // 用户名，以字母开头，6-20位字母、数字、下划线或减号
	'date'		=> '/^\d{4}-\d{2}-\d{2}$/',
	'phone' 	=> '/^((\(\d{2,3}\))|(\d{3}\-))?(\(0\d{2,3}\)|0\d{2,3}-)?[1-9]\d{6,7}(\-\d{1,4})?$/',
	'mobile' 	=> '/^((\(\d{2,3}\))|(\d{3}\-))?(13|15|18)\d{9}$/',
);

?>